In [1]:
import pandas as pd
import numpy as np

## pandas dataframe 赋值操作2

In [2]:
df = pd.read_csv('data/employee_sample.csv',index_col=0)
df

          GENDER   RACE          DEPARTMENT  YEARS EXPERIENCE  SALARY
Tom         Male  White         Engineering                23  107962
Niko        Male  Black         Engineering                 1   30347
Penelope  Female  White         Engineering                12   60258
Aria      Female  Black         Engineering                 8   43618
Sofia     Female  Black  Parks & Recreation                23   26125
Dean        Male  Black  Parks & Recreation                 3   33592
Zach        Male  White  Parks & Recreation                 4   37565

In [3]:
df['BONUS RATE'] = [.2, .1, .13, .15, .12, .3, .05]
df

,GENDER,RACE,DEPARTMENT,YEARS EXPERIENCE,SALARY,BONUS RATE
Tom,Male,White,Engineering,23,107962,0.20
Niko,Male,Black,Engineering,1,30347,0.10
Penelope,Female,White,Engineering,12,60258,0.13
Aria,Female,Black,Engineering,8,43618,0.15
Sofia,Female,Black,Parks & Recreation,23,26125,0.12
Dean,Male,Black,Parks & Recreation,3,33592,0.30
Zach,Male,White,Parks & Recreation,4,37565,0.05

  + 根据salary 与bonusrate 计算bonus并且增加bonus列

In [4]:
df['bonus']=df['SALARY']*df['BONUS RATE']
df

,GENDER,RACE,DEPARTMENT,YEARS EXPERIENCE,SALARY,BONUS RATE,bonus
Tom,Male,White,Engineering,23,107962,0.20,21592.40
Niko,Male,Black,Engineering,1,30347,0.10,3034.70
Penelope,Female,White,Engineering,12,60258,0.13,7833.54
Aria,Female,Black,Engineering,8,43618,0.15,6542.70
Sofia,Female,Black,Parks & Recreation,23,26125,0.12,3135.00
Dean,Male,Black,Parks & Recreation,3,33592,0.30,10077.60
Zach,Male,White,Parks & Recreation,4,37565,0.05,1878.25

+ 修改所有的bonus为10000
   - 方式1：

In [5]:
df['bonus']=10000

In [6]:
df

,GENDER,RACE,DEPARTMENT,YEARS EXPERIENCE,SALARY,BONUS RATE,bonus
Tom,Male,White,Engineering,23,107962,0.20,10000
Niko,Male,Black,Engineering,1,30347,0.10,10000
Penelope,Female,White,Engineering,12,60258,0.13,10000
Aria,Female,Black,Engineering,8,43618,0.15,10000
Sofia,Female,Black,Parks & Recreation,23,26125,0.12,10000
Dean,Male,Black,Parks & Recreation,3,33592,0.30,10000
Zach,Male,White,Parks & Recreation,4,37565,0.05,10000

+ 
   - 方式2：

In [7]:
df.loc[:,'bonus']=9999

In [8]:
df

,GENDER,RACE,DEPARTMENT,YEARS EXPERIENCE,SALARY,BONUS RATE,bonus
Tom,Male,White,Engineering,23,107962,0.20,9999
Niko,Male,Black,Engineering,1,30347,0.10,9999
Penelope,Female,White,Engineering,12,60258,0.13,9999
Aria,Female,Black,Engineering,8,43618,0.15,9999
Sofia,Female,Black,Parks & Recreation,23,26125,0.12,9999
Dean,Male,Black,Parks & Recreation,3,33592,0.30,9999
Zach,Male,White,Parks & Recreation,4,37565,0.05,9999

+ 修改YEARS EXPERIENCE数据类型

In [11]:
df['YEARS EXPERIENCE'].dtype

dtype('int64')

In [18]:
df['YEARS EXPERIENCE']=df['YEARS EXPERIENCE'].astype('object')

In [20]:
df['YEARS EXPERIENCE']

Tom         23
Niko         1
Penelope    12
Aria         8
Sofia       23
Dean         3
Zach         4
Name: YEARS EXPERIENCE, dtype: object

In [21]:
df['YEARS EXPERIENCE'].dtype

dtype('O')

In [ ]:
+ 给bonus列的['Niko', 'Penelope', 'Aria'] 赋值

In [22]:
df.loc[['Niko', 'Penelope', 'Aria'],'bonus']=[2301,4563,6548]

In [23]:
df

,GENDER,RACE,DEPARTMENT,YEARS EXPERIENCE,SALARY,BONUS RATE,bonus
Tom,Male,White,Engineering,23,107962,0.20,9999
Niko,Male,Black,Engineering,1,30347,0.10,2301
Penelope,Female,White,Engineering,12,60258,0.13,4563
Aria,Female,Black,Engineering,8,43618,0.15,6548
Sofia,Female,Black,Parks & Recreation,23,26125,0.12,9999
Dean,Male,Black,Parks & Recreation,3,33592,0.30,9999
Zach,Male,White,Parks & Recreation,4,37565,0.05,9999

+ 使用iloc 赋值

In [24]:
df.iloc[3:6,3]=10

In [25]:
df

,GENDER,RACE,DEPARTMENT,YEARS EXPERIENCE,SALARY,BONUS RATE,bonus
Tom,Male,White,Engineering,23,107962,0.20,9999
Niko,Male,Black,Engineering,1,30347,0.10,2301
Penelope,Female,White,Engineering,12,60258,0.13,4563
Aria,Female,Black,Engineering,10,43618,0.15,6548
Sofia,Female,Black,Parks & Recreation,10,26125,0.12,9999
Dean,Male,Black,Parks & Recreation,10,33592,0.30,9999
Zach,Male,White,Parks & Recreation,4,37565,0.05,9999

In [27]:
df.iloc[:,3]=33
df

,GENDER,RACE,DEPARTMENT,YEARS EXPERIENCE,SALARY,BONUS RATE,bonus
Tom,Male,White,Engineering,33,107962,0.20,9999
Niko,Male,Black,Engineering,33,30347,0.10,2301
Penelope,Female,White,Engineering,33,60258,0.13,4563
Aria,Female,Black,Engineering,33,43618,0.15,6548
Sofia,Female,Black,Parks & Recreation,33,26125,0.12,9999
Dean,Male,Black,Parks & Recreation,33,33592,0.30,9999
Zach,Male,White,Parks & Recreation,33,37565,0.05,9999

In [ ]:
+ 使用loc 筛选数据并修改其值
    - 修改DEPARTMENT列中等于Engineering，对应的bonus值

In [28]:
df.loc[df['DEPARTMENT']=='Engineering','bonus']+=500

In [29]:
df

,GENDER,RACE,DEPARTMENT,YEARS EXPERIENCE,SALARY,BONUS RATE,bonus
Tom,Male,White,Engineering,33,107962,0.20,10499
Niko,Male,Black,Engineering,33,30347,0.10,2801
Penelope,Female,White,Engineering,33,60258,0.13,5063
Aria,Female,Black,Engineering,33,43618,0.15,7048
Sofia,Female,Black,Parks & Recreation,33,26125,0.12,9999
Dean,Male,Black,Parks & Recreation,33,33592,0.30,9999
Zach,Male,White,Parks & Recreation,33,37565,0.05,9999

## Series 赋值操作

In [30]:
s=df['SALARY'].copy()
s

Tom         107962
Niko         30347
Penelope     60258
Aria         43618
Sofia        26125
Dean         33592
Zach         37565
Name: SALARY, dtype: int64

In [35]:
s.loc[['Tom','Niko','Aria']]=[99,123,321]

In [36]:
s

Tom            99
Niko          123
Penelope       33
Aria          321
Sofia       26125
Dean        33592
Zach        37565
Name: SALARY, dtype: int64

In [33]:
s.iloc[1:3]=33

In [34]:
s

Tom            99
Niko           33
Penelope       33
Aria           99
Sofia       26125
Dean        33592
Zach        37565
Name: SALARY, dtype: int64